<script setup>

import ThemeChanger from "@/components/themeChanger.vue";
import Footer from "@/layouts/Footer.vue";
</script>

<template>
  <div class="max-w-[1000px] m-auto my-20">
    <themeChanger/>
    <div class="card prose max-w-none w-full shadow-2xl bg-base-200 text-wrap break-words overflow-hidden p-8">
      <h1>使用条款</h1>
      <p>使用 TurboServlet 提供的服务之前，您必须接受以下内容。</p>
      <p> 访问与使用此网站（<a class="link link-hover !not-italic"
                              href="https://mai-turbo.net">https://mai-turbo.net</a>）、
        客户端以及任何关联服务（以下统称“<b>Turbo</b>”）即代表您确认您完全遵守此处列出的条款和条件，且保证您不会将
        TurboServlet 提供服务的任何内容（包括本网站与本网站提供的内容）用于任何违法或被条款禁止的目的。 </p>
      <p>在该份条款之外，您还需要确保接受我们的 <router-link to="/privacy" class="">隐私政策</router-link>。
      </p>
      <h2>服务描述</h2>
      <p>Turbo 在法律允许的范围内向用户提供在线服务。若用户未经某公司授权向某地区提供非法的在线服务，Turbo
        不对该行为承担任何责任。然而，在法律框架内，Turbo 可以协助提供相关数据或其他法律支持。用户由此行为产生的任何后果，Turbo
        概不负责。</p>
      <p>Turbo 网页中提供托管用户上传内容的服务，使其他用户能够访问这些内容。对于用户上传的内容，无论该内容是否被视为令人反感、政治敏感、违法、侵犯知识产权或其他不当内容，TurboNET
        具有自主判断权，并有权对相关账号采取封禁等处理措施。然而，Turbo
        不对及时清除用户上传的违规内容作出任何保证，也不保证用户拥有发布或分发已上传内容的合法权利。对于因用户上传或分发内容所引发的任何法律后果，TurboNET
        概不承担责任。</p>
      <h2>使用条款的修改</h2>
      <p>Turbo 保留自由修改使用条款的权利。</p>
      <p>使用条款以最新版为准。未遵守可能导致您被禁用 Turbo 的服务。</p>
      <h2>服务的修改</h2>
      <p>Turbo 保留修改或终止服务而不向用户通知的权利。</p>
      <p>Turbo 在行使修改或终止服务权利时，不对任何用户或第三方承担责任。</p>
      <h2>免责声明</h2>
      <p> 本文材料均以“现状”提供。Turbo
        不提供任何明示或暗示的保证，且在此声明并否认所有其他保证，包括但不限于对适销性、特定用途适用性或知识产权的非侵权性或其他权利的侵犯的暗示保证或条件。 </p>
      <p>此外，Turbo
        不保证或作出任何关于材料使用的准确性、可能结果或可靠性的陈述，或与此类材料相关的其他陈述。</p>
      <p>最后，Turbo 没有义务（明示或暗示）为其服务提供任何维护、技术支持或其他支持。</p>
      <h2>赔偿责任</h2>
      <p>若由于：</p>
      <p>(i) 您对 Turbo 的使用和访问；</p>
      <p>(ii) 您违反这些使用条款的任何条件；</p>
      <p>(iii) 您侵犯任何第三方权利，包括但不限于任何版权、财产或隐私权；</p>
      <p>(iv) 您上传的内容对第三方造成了损害；</p>
      <p>(v) 其它您应承担责任的情形。</p>
      <p> 导致了 Turbo 可能面临损失。您同意主动解决争端并作出必要赔偿，使
        TurboServlet 免受任何索赔、损害、损失或债务以及开支（包括但不限于律师费）等负面影响。 </p>
      <p>此责任将在这些使用条款和您使用 Turbo 之后继续存在。</p>
      <h2>您对 Turbo 客户端的安装与使用 </h2>
      <p> Turbo 的运作方式为基于路由器的智能数据中转与分发、通信增强以及流量优化管理。Turbo
        仅允许用户在经过某公司授权的前提下，出于测试及开发目的进行合法安装和使用。用户一旦安装并部署或在已经安装客户端上游玩，即视为确认并同意上述条款具有法律效力。
        若用户提供虚假信息或行为导致第三方追究法律责任，Turbo
        概不承担任何责任。因此，严禁用户在未经某公司授权的情况下，向任何地区提供非法的在线服务。并且在法律允许的范围内，Turbo
        可协助第三方提供相关数据或法律支持。</p>
      <h2>您对 Turbo 网页内容的使用</h2>
      <p> 您应理解以下内容：在使用 Turbo 网页的过程中，您将会接触来自各种来源的用户上传内容，且 Turbo
        对这些用户上传内容的准确性、实用性、安全性或知识产权不负责。此外，你理解并承认，您可能会接触到不准确、冒犯、淫秽或令人反感的用户上传内容，并且您同意放弃在此方面可能拥有的法律或公平权利或救济措施，同意在法律允许的最大范围内，就与您使用该网站相关的所有事项，对
        TurboServlet、其所有者/运营者或许可方免责。 </p>
      <h2>用户上传内容和内容删除</h2>
      <p> 您对您自己的用户上传内容及其发布或发表的后果负完全责任。关于用户上传内容，您确认、声明或保证：您拥有或具备必要的许可、权利、同意和权限，以便使用并授权
        Turbo
        使用一切专利、商标、商业秘密、版权或其他专有权利，以便按照网站和这些使用条款的规定的方式包含和使用所有用户提交内容。关于用户提交内容，您同意不会提交受版权保护、受商业秘密保护或受第三方专有权利（包括隐私和公众形象权）约束的材料，除非您是这些权利的所有者，或者已获得其合法所有者的许可来发布此材料，并授权
        Turbo 拥有在此授予的所有许可权利。 </p>
      <p> 内容上传在 Turbo 在线社区不代表 Turbo 对其认可，也不代表 Turbo 认可其中表达的任何观点、建议或意见。Turbo
        明确否认与用户提交内容相关的任何和所有责任。Turbo
        不允许在其网站上进行侵犯版权的活动和侵犯知识产权的行为，如果得到适当的通知表明此类内容或用户提交内容侵犯了他人的知识产权，Turbo
        有权力删除或进一步维权。 </p>
      <p>Turbo 保留在没有事先通知的情况下删除内容和用户提交内容、使用账号的权利。</p>
      <h2>隐私保护与信息收集政策</h2>
      <p>参见 <router-link to="/privacy" class="">隐私政策</router-link>。</p>
      <h2>内容的专有权利</h2>
      <p> 您应承认，Turbo
        所提供的内容，包括但不限于文本、软件、音乐、声音、照片、视频、图形、名称引用或其他通过服务向用户提供或用户访问的材料（“内容”），受版权、商标、服务标志、专利或其他专有权利和法律的保护；因此，用户只有在获得明确授权的情况下才能使用此内容。 </p>
      <p>用户不得未经法律授权，对内容进行任何可能侵害版权方利益的行为，包括从这些内容中创建衍生作品。Turbo
        保留追责的权利。</p>
      <h2>链接</h2>
      <p>Turbo 可能提供其他网站或资源的链接。您可能在电子邮件等处中接收到这些链接。</p>
      <p>您应接受 Turbo 不对这些外部网站或资源的负责，并且不代表 Turbo 认可其中的内容。Turbo
        不对这些网站或资源上或可用的任何内容、广告、产品或其他材料负责或承担任何责任。</p>
      <p>您应同意 Turbo
        不会直接或间接地对因使用或依赖这些外部网站或资源上的任何内容、商品或服务而引起或声称引起的任何损害或损失负责或承担任何责任。</p>
      <h2>适用法律</h2>
      <p>本内容所涉及条款受中华人民共和国法律管辖并根据其进行解释。</p>
      <h2>归属</h2>
      <p>本文部分内容基于“osu! 服务条款”和“Terms of Service - Cytoid”，并已通过 CC-BY-NC 4.0
        获得许可。</p>
    </div>
  </div>
  <Footer/>
</template>

<style scoped>
</style>